tap "teamookla/speedtest"

brew "ack"
brew "autoconf"
brew "automake"
brew "bandwhich"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "binutils"
brew "calc"
brew "cloc"
brew "cmatrix"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "diffutils"
brew "ed"
brew "exiftool"
brew "ffmpeg"
brew "figlet"
brew "findutils"
brew "fortune"
brew "fzf"
brew "gawk"
brew "git"
brew "git-extras"
brew "git-gui"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-units"
brew "gnu-which"
brew "gnutls"
brew "go"
brew "gpatch"
brew "graphicsmagick"
brew "grep"
brew "gzip"
brew "htop"
brew "imagemagick"
brew "inetutils"
brew "irssi"
brew "java"
brew "jq"
brew "launchctl-completion"
brew "less"
brew "lynx"
brew "make"
brew "mole"
brew "mysql-client"
brew "multitail"
brew "nano"
brew "ngrep"
brew "nmap"
brew "node"
brew "onefetch"
brew "p7zip"
brew "pipx"
brew "pstree"
brew "python"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "screen"
brew "speedtest"
brew "tlrc"
brew "tree"
brew "uv"
brew "vim"
brew "watch"
brew "wdiff"
brew "wget"
brew "witr"
brew "wrk"
brew "xz"

cask "brave-browser"
cask "chatgpt"
cask "datagrip"
cask "deepl"
cask "docker-desktop"
cask "firefox@developer-edition"
cask "flycut"
cask "gimp"
cask "ghostty"
cask "hiddenbar"
cask "iterm2"
cask "itsycal"
cask "ngrok"
cask "openmtp"
cask "phpstorm"
cask "postman"
cask "qlmarkdown"
cask "quicklook-video"
cask "rectangle"
cask "slack"
cask "spotify"
cask "stats"
cask "sublime-text"
cask "syntax-highlight"
cask "typora"
cask "utm"
cask "vicinae"
cask "vlc"
cask "whatcable"

# include an additional custom Brewfile
filepath = File.expand_path("~/.dotfiles/._system/custom/.brewfile")
if File.exist?(filepath)
  instance_eval(File.read(filepath))
end

