tap "buo/cask-upgrade"
tap "dawidd6/autoremove"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "ack"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "binutils"
brew "brew-cask-completion"
brew "calc"
brew "cloc"
brew "cmake"
brew "cmatrix"
brew "colordiff"
brew "coreutils"
brew "cowsay"
brew "curl"
brew "diffutils"
brew "docker-completion"
brew "ed"
brew "elinks"
brew "entr"
brew "ffmpeg"
brew "figlet"
brew "findutils"
brew "fortune"
brew "fzf"
brew "gawk"
brew "gdb"
brew "git"
brew "git-extras"
brew "git-gui"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-units"
brew "gnu-which"
brew "gnupg"
brew "gnutls"
brew "gpatch"
brew "graphicsmagick"
brew "grep"
brew "gzip"
brew "htop-osx"
brew "icoutils"
brew "imagemagick"
brew "inetutils"
brew "irssi"
brew "java"
brew "jq"
brew "launchctl-completion"
brew "lazygit"
brew "less"
brew "links"
brew "lynx"
brew "make"
brew "mas"
brew "mitmproxy"
brew "moreutils"
brew "mysql-client"
brew "ncdu"
brew "nmap"
brew "openvpn"
brew "p7zip"
brew "pidof"
brew "pinentry-mac"
brew "pstree"
brew "python"
brew "rename"
brew "rsync"
brew "screen"
brew "speedtest-cli"
brew "tcl-tk"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "upx"
brew "vagrant-completion"
brew "vim"
brew "watch"
brew "wdiff"
brew "wget"
brew "wrk"
brew "xz"
brew "youtube-dl"
cask "alacritty"
cask "android-file-transfer"
cask "balenaetcher"
cask "brave-browser"
cask "deepl"
cask "docker-edge"
cask "dropbox"
cask "evernote"
cask "firefox-developer-edition"
cask "flycut"
cask "gimp"
cask "gitahead"
cask "handbrake"
cask "hex-fiend"
cask "iterm2"
cask "itsycal"
cask "joinme"
cask "kindle"
cask "lastfm"
cask "libreoffice"
cask "libreoffice-language-pack"
cask "licecap"
cask "macdown"
cask "macpass"
cask "monolingual"
cask "opera-developer"
cask "phpstorm"
cask "poedit"
cask "postman"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "rectangle"
cask "rescuetime"
cask "skype"
cask "slack"
cask "spotify"
cask "spotmenu"
cask "sublime-text"
cask "suspicious-package"
cask "tagger"
cask "tomighty"
cask "transmission"
cask "tunnelblick"
cask "typora"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"
cask "vox"
cask "webpquicklook"
cask "xquartz"
cask "zoom"

# include an additional custom Brewfile
filepath = File.expand_path("~/.dotfiles/._system/custom/.brewfile")
if File.exists?(filepath)
  instance_eval(File.read(filepath))
end

